app/controllers/admin_controller.rb

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "telnr" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["telnr", "43211234"], ["updated_at", "2023-10-27 09:12:15.254878"], ["id", 2]]