app/controllers/packages_controller.rb

  def index
    @packages = Package.all
---
SELECT "packages".* FROM "packages"

  def create
    @package = Package.new(package_params)

    if @package.save
---
INSERT INTO "packages" ("sender", "recipient", "content", "weight", "destination", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def edit
    @package = Package.find(params[:id])
---
SELECT "packages".* FROM "packages" WHERE "packages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @package = Package.find(params[:id])

    Package.transaction do
      if @package.update(package_params)
---
SELECT "packages".* FROM "packages" WHERE "packages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "packages" SET "weight" = ?, "updated_at" = ? WHERE "packages"."id" = ?  [["weight", "adminasdf"], ["updated_at", "2023-10-27 14:10:30.594319"], ["id", 4]]

  def destroy
    @package = Package.find(params[:id])
    @package.destroy
---
SELECT "packages".* FROM "packages" WHERE "packages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "packages" WHERE "packages"."id" = ?  [["id", 2]]