app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "password_confirmation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "admin"], ["password_digest", "[FILTERED]"], ["password_confirmation", "[FILTERED]"], ["created_at", "2023-10-20 09:03:30.618785"], ["updated_at", "2023-10-20 09:03:30.618785"]]

  def update
    @user = current_user

    if @user.update(user_params)
---
UPDATE "users" SET "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["address", "adminaddresse"], ["updated_at", "2023-10-26 10:17:22.237690"], ["id", 1]]