app/controllers/user_sessions_controller.rb

  def create
    @user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin"], ["LIMIT", 1]]